Table of Contents
 Class RebarSegment3DLine
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a line segment in 3D space.
public class RebarSegment3DLine : RebarSegment3DBase
Inheritance
object
OpenObject
RebarSegment3DBase
RebarSegment3DLine
Inherited Members
 RebarSegment3DBase.EndPoint
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page